projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЗагрузкаРееструТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаРееструТД</Name>
			<Comment>Загрузка транзитных деклараций из CSV-файла Владимира. Matcher по колонке «Номер ДДП ТД».</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлCSV</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокКомплекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокНовыеТД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокПроблемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокТолькоОбеспечение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредложенияКлассификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type><v8:Type>xs:boolean</v8:Type></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Comment>Комплекс / НоваяТД / Проблема / ТолькоОбеспечение</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>30</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомерТД</Name>
							<Comment>CSV col #12</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДДПТД</Name>
							<Comment>CSV col #33 — ключ matcher'а</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>CSV col #4 — справочная информация</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>100</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Comment>CSV col #15</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыпуска</Name>
							<Comment>CSV col #28</Comment>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодовТНВЭД</Name>
							<Comment>CSV col #45 — готовое для Schema 4</Comment>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаДокумент</Name>
							<Comment>Найденная ссылка на ОперацияПоПоручительству (для Комплекс/ТолькоОбеспечение)</Comment>
							<Type><v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Comment>Номер строки ТЧ ДанныеДокументов, если найдена</Comment>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>5</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПолучателя</Name>
							<Comment>CSV col #47 — для lookup контрагента</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>12</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолучателя</Name>
							<Comment>CSV col #16</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроцесса</Name>
							<Comment>CSV col #6</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>CSV col #13</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>false</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Comment>Причина ошибки matcher'а или результат apply</Comment>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>500</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
							<Format/><EditFormat/>							<MarkNegatives>false</MarkNegatives>							<MultiLine>true</MultiLine>							<MinValue xsi:nil="true"/>							<ChoiceParameterLinks/>							<QuickChoice>Auto</QuickChoice>							<ChoiceForm/><LinkByType/>						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЗагрузкаРееструТД/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// До загрузки CSV - скрываем статистику и кнопку «Применить».
	// Они появятся только после успешного «Прочитать CSV».
	Элементы.ГруппаСтатистика.Видимость = Ложь;
	Элементы.КнопкаПрименить.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ФайлCSVНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Оповещение = Новый ОписаниеОповещения("ФайлCSVНачалоВыбораЗавершение", ЭтотОбъект);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выбор файла реестра ЭТД";
	ДиалогВыбора.Фильтр = "CSV файлы (*.csv)|*.csv|Все файлы (*.*)|*.*";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ФайлCSVНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Объект.ФайлCSV = ВыбранныеФайлы[0];

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьCSV(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ФайлCSV) Тогда
		ПоказатьПредупреждение(, "Укажите путь к файлу CSV");
		Возврат;
	КонецЕсли;

	Состояние("Читаем CSV и сопоставляем с базой...");
	ПрочитатьCSVСервер();
	Состояние();

	Элементы.ГруппаСтатистика.Видимость = Истина;
	Элементы.КнопкаПрименить.Видимость = Истина;

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(
		"Прочитано строк: %1. Комплекс: %2, Новые ТД: %3, Проблемы: %4, ТолькоОбеспечение: %5.",
		Объект.СтрокВсего, Объект.СтрокКомплекс, Объект.СтрокНовыеТД, Объект.СтрокПроблемы, Объект.СтрокТолькоОбеспечение);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)

	КоличествоВыбранных = ПодсчитатьВыбранные();
	Если КоличествоВыбранных = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одной строки для применения");
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПрименитьЗавершение", ЭтотОбъект);
	Текст = СтрШаблон("Применить классификацию к %1 строкам?", КоличествоВыбранных);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Состояние("Применение классификации...");
	Результат = ПрименитьСервер();
	Состояние();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(
		"Обогащено: %1, Создано новых ТД: %2, Помечено ТолькоОбеспечение: %3. Ошибок: %4.",
		Результат.Обогащено, Результат.Создано, Результат.ПомеченоТолькоОбеспечение, Результат.Ошибки.Количество());
	Сообщение.Сообщить();

	Для Каждого ТекстОшибки Из Результат.Ошибки Цикл
		ЗаписьОшибки = Новый СообщениеПользователю;
		ЗаписьОшибки.Текст = ТекстОшибки;
		ЗаписьОшибки.Сообщить();
	КонецЦикла;

	Если Результат.Ошибки.Количество() = 0 Тогда
		ОчиститьПослеПримененияСервер();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьПослеПримененияСервер()

	Объект.ПредложенияКлассификации.Очистить();
	Объект.СтрокВсего = 0;
	Объект.СтрокКомплекс = 0;
	Объект.СтрокНовыеТД = 0;
	Объект.СтрокПроблемы = 0;
	Объект.СтрокТолькоОбеспечение = 0;
	Объект.ФайлCSV = "";

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьCSVСервер()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ПредложенияКлассификации.Очистить();

	ТаблицаCSV = ОбъектОбработки.ПрочитатьCSVФайл(Объект.ФайлCSV);
	ТаблицаПредложений = ОбъектОбработки.СопоставитьСДокументами(ТаблицаCSV);

	Для Каждого Строка Из ТаблицаПредложений Цикл
		НоваяСтрока = ОбъектОбработки.ПредложенияКлассификации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

	ОбъектОбработки.СтрокВсего = ТаблицаCSV.Количество();
	ОбъектОбработки.СтрокКомплекс = 0;
	ОбъектОбработки.СтрокНовыеТД = 0;
	ОбъектОбработки.СтрокПроблемы = 0;
	ОбъектОбработки.СтрокТолькоОбеспечение = 0;

	Для Каждого Строка Из ОбъектОбработки.ПредложенияКлассификации Цикл
		Если Строка.Категория = "Комплекс" Тогда
			ОбъектОбработки.СтрокКомплекс = ОбъектОбработки.СтрокКомплекс + 1;
		ИначеЕсли Строка.Категория = "НоваяТД" Тогда
			ОбъектОбработки.СтрокНовыеТД = ОбъектОбработки.СтрокНовыеТД + 1;
		ИначеЕсли Строка.Категория = "Проблема" Тогда
			ОбъектОбработки.СтрокПроблемы = ОбъектОбработки.СтрокПроблемы + 1;
		ИначеЕсли Строка.Категория = "ТолькоОбеспечение" Тогда
			ОбъектОбработки.СтрокТолькоОбеспечение = ОбъектОбработки.СтрокТолькоОбеспечение + 1;
		КонецЕсли;
	КонецЦикла;

	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");

КонецПроцедуры

&НаСервере
Функция ПрименитьСервер()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектОбработки.ПрименитьКлассификацию(ОбъектОбработки.ПредложенияКлассификации.Выгрузить());

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПодсчитатьВыбранные()

	Количество = 0;
	Для Каждого Строка Из Объект.ПредложенияКлассификации Цикл
		Если Строка.Выбрать Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Количество;

КонецФункции

#КонецОбласти
